app/controllers/blogpost_controller.rb

SELECT * FROM `blogposts`
SELECT * FROM `comments`
---
  def index
    @bs = Blogpost.all
    @comments = Comment.all