app/controllers/users_controller.rb

  def edit_profile
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def upload
    @user = User.find(params[:id])
    if params[:user].present? and params[:user][:avatar].present?
      @user.attributes = @user.attributes.merge(params[:user])
      if @user.save(false)
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-11-25 07:28:38', `avatar_file_size` = 15428, `avatar_file_name` = 'Abdul-Kalam3.2.jpg' WHERE `id` = 1